<template>
  <div class="container">
    <span>大学課題（制作中）</span>
    <h3>Time Sphere</h3>

    <div class="basicInfo">
      <ul>
        <li>開発期間：2022/05/04 ~</li>
        <li>担当：企画、デザイン、開発</li>
        <li>開発技術：工作、Arduino</li>
      </ul>
    </div>

    <section>
      <h4>Time Sphereとは</h4>
      <p>
        現代の人類は天文台が発表する時刻に基づいて基地局の値を設定し、それを電波として受け取る時計を元に時間を知覚している。しかし、時計が生まれる以前は「水時計」や「日時計」など自然現象を用いておおよその時間を測っていた。
        特に代表的なのは、天体を利用した時計だろう。人類は太古から太陽や月の位置や明るさによって、それを<strong>数値に置き換えることなく感覚的に時間を認識してきた</strong>。
        私は、これこそ、人間と人間以外の存在（時間）の失われた関係ではないかと思い、これを取り戻したいと考えた。具体的には、数値化された時間ではなく感覚的な時間を把握することで、１日のグラデーションによって生まれる自然現象（太陽の色、鳥のさえずり、虫が草をかき分ける音など）の観測や人間の自然な生活リズムを取り戻したい。<strong
          >時間をスケジュールの単位ではなく、美しい自然現象の一つとして認識したい。</strong
        >
      </p>
      <img src="/works/fsemi/01.png" />
    </section>

    <section>
      <h4>開発のきっかけ</h4>
      <p>
        課題のテーマは<strong>「人間と人間以外の存在との関係の修復」</strong>。初めは家庭菜園を考えたり、微生物の活動を学べるコンテンツを作ろうと考えていたが、自分のやりたいこととしてピンと来なかった。
      </p>
      <p>
        そこで、今までは「人間以外の存在」を列挙してアイデアを探していたが、今回は「自分の興味があるもの」を列挙し、そのうち関係が破綻していたり、修復する余地のありそうなものを探した。私の興味のあるものは、
      </p>
      <ul>
        <li>IT技術</li>
        <li>宇宙</li>
        <li>腕時計</li>
        <li>ガンダムなどSF映画</li>
      </ul>
      <p>
        が主である。中でも、<strong>宇宙</strong>については基礎演習でも応用演習でも、プロジェクトでも挑もうとしたが、<strong>アイデア発想に至らず悔しい思いをし続けているカテゴリである。</strong>おそらく大学で最後の制作チャンスとなるであろうこのフィールド演習で、是非とも宇宙に関連したプロダクトを制作したい。
      </p>
      <p>
        そこで発想したのは<strong>「時間との関係の修復」</strong>。このTime
        Sphereであった。
      </p>
    </section>

    <section>
      <h4>プロトタイプ</h4>
      <p>2022年6月時点で、アイデア構想を固めダーティプロトタイプを制作した。</p>
      <p>
        5月はアイデア発想でほとんどの時間を使用してしまったため、僅か１週間でArduinoを使用した電気工作に入門しフルカラーLEDを点灯させた。プログラミングは経験があったためなんとか英語のドキュメントや海外の掲示板を読み込むことで無事ここまで実装することができた。
      </p>
      <video src="/works/fsemi/02.mp4" autoplay loop></video>
      <p>
        プロトタイプだけを見るとなんとも切ないものであるが、ゼロから電気工作を学び、これを制作できたことは一つ達成感があった。
      </p>
    </section>

    <section class="section3">
      <h4>アピールポイント</h4>
      <p>
        これは時間経過で色が変わるライトであり、環境音のBGMと合わせて<strong>感覚的に時間を把握することができる</strong>。リモートワークやオンライン授業で部屋の中にいることが多いが、小学生時代の「暗くなったから帰る！」のような感覚的な時間把握を室内でも行い、<strong>時計の針に縛られない気楽な生活を味わってほしい</strong>。
      </p>
    </section>

    <section>
      <h4>中間発表会</h4>
      <p>
        2022年6月、夏季休暇前に中間発表会が行われ、プロトタイプを持ち寄り学生一人ひとりがブースを設けて互いにフィードバックし合った。
      </p>
      <p>
        現状はLEDが光っているだけの退屈なプロダクトであるため、成果物として全く自信がなかった。
        しかし、その代わりに力を入れた説明パネルやブースアイテムの設計が功を奏し、先生方からも同級生からも上々の評価をいただいた。
      </p>
      <img src="/works/fsemi/03.jpg" />
      <p>ブースの様子</p>
      <p>フィードバックでは、以下のようなご意見をいただいた。</p>
      <ul>
        <li>
          <strong
            >地下室などでは自然光が遮光されるので、より人工的な空間になりこのプロダクトの価値が高くなるのでは</strong
          >
        </li>
        <li>
          録音や人工の環境音ではなく、実際に外の音をライブ中継できたらよりリアル
        </li>
        <li>風で木の葉が擦れる音などが環境音として優しくて良いのではないか</li>
      </ul>
      <p>
        確かに、地下室などの外界と遮断された空間であればTime
        Sphereの効果が最大限に発揮されるかもしれないと感じた。ユーザーテストなども重ねて検証していきたい。
      </p>
    </section>

    <section>
      <h4>今後の展望</h4>
      <span>（2022年7月時点）</span>
      <p>環境音と光の色とをリンクさせたい。</p>
      <p>
        LEDのカバーも制作しなければならない。私の意図する宇宙的な要素とエコロジーを感じる素材を掛け合わせたいと考え、「和紙」で制作しようと考えた。
      </p>
      <p>まずはこれらを実践し、プロダクトとしての完成度を上げていきたい。</p>
    </section>
  </div>
</template>

<script>
export default {}
</script>

<style lang="scss" scoped>
@import '@/assets/scss/WorksPagesCommon.scss';

img,
video {
  display: block;
  width: 100%;
  max-width: 500px;
}

ul {
  list-style-type: disc;
  margin-left: 3rem;
}
.section3 {
  > img {
    width: 18rem;
    margin: 0 auto;
    margin-bottom: 1rem;
  }
}
</style>
